test/test_artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 12:25:41(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 12:25:42(-0300)

All VUs finished. Total time: 15 seconds

--------------------------------
Summary report @ 12:25:54(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 42/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 58
  max: ......................................................................... 1010
  median: ...................................................................... 108.9
  p95: ......................................................................... 596
  p99: ......................................................................... 685.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8758.4
  max: ......................................................................... 10445.3
  median: ...................................................................... 9607.1
  p95: ......................................................................... 10407.3
  p99: ......................................................................... 10407.3